Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServerProxy.GetDataSchema
Obtains the schema of the ESEntity.
Returns:
Null if the server has no data.
Since:
2014

Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServerProxy.IsApplicable(Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData)
Check if the server is applicable for the duct fitting or duct accessory.
data:
The input data of the calculation.
Since:
2014

Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServerProxy.Calculate(Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData)
Calculate the duct fitting and duct accessory coefficient.
data:
The input and output data of the calculation.
Returns:
True if calculation succeeds.
False if calculation fails.
Since:
2014